In [174]:
import numpy as np
import pandas as pd

In [175]:
pd.NaT

NaT

In [176]:
np.nan == np.nan

False

In [177]:
np.nan is np.nan

True

In [178]:
df = pd.read_csv(
    "C:\\Coding\\python-projects\\ml-jose-portilla\\jose\\03-Pandas\\movie_scores.csv"
)

In [179]:
df["sex"]  = df["sex"].replace(["m","f"],["Male","Female"])

In [180]:
df.head()

  first_name last_name   age     sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    Male              8.0              10.0
1        NaN       NaN   NaN     NaN              NaN               NaN
2       Hugh   Jackman  51.0    Male              NaN               NaN
3      Oprah   Winfrey  66.0  Female              6.0               8.0
4       Emma     Stone  31.0  Female              7.0               9.0

In [181]:
df[df["pre_movie_score"].notnull()]

  first_name last_name   age     sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    Male              8.0              10.0
3      Oprah   Winfrey  66.0  Female              6.0               8.0
4       Emma     Stone  31.0  Female              7.0               9.0

In [182]:
df[(df["pre_movie_score"].isnull()) & (df["sex"] == "Male")]

  first_name last_name   age   sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0  Male              NaN               NaN

In [183]:
df

  first_name last_name   age     sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    Male              8.0              10.0
1        NaN       NaN   NaN     NaN              NaN               NaN
2       Hugh   Jackman  51.0    Male              NaN               NaN
3      Oprah   Winfrey  66.0  Female              6.0               8.0
4       Emma     Stone  31.0  Female              7.0               9.0

In [184]:
df.dropna()

  first_name last_name   age     sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    Male              8.0              10.0
3      Oprah   Winfrey  66.0  Female              6.0               8.0
4       Emma     Stone  31.0  Female              7.0               9.0

In [185]:
df.dropna(subset=["age","sex","pre_movie_score","post_movie_score"])

  first_name last_name   age     sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    Male              8.0              10.0
3      Oprah   Winfrey  66.0  Female              6.0               8.0
4       Emma     Stone  31.0  Female              7.0               9.0

In [186]:
df = df.dropna(how="all")

In [187]:
numeric_df = df.select_dtypes(include=np.number)
numeric_df

    age  pre_movie_score  post_movie_score
0  63.0              8.0              10.0
2  51.0              NaN               NaN
3  66.0              6.0               8.0
4  31.0              7.0               9.0

In [189]:
df.loc[:,numeric_df.columns] = numeric_df.fillna(numeric_df.mean())

  first_name last_name   age     sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    Male              8.0              10.0
2       Hugh   Jackman  51.0    Male              7.0               9.0
3      Oprah   Winfrey  66.0  Female              6.0               8.0
4       Emma     Stone  31.0  Female              7.0               9.0